<?php

require_once "php/versao.php";
require_once "php/services/senha_service.php";

session_start();

if ($_SESSION['logado']) {
  header("Location: index.php");
  exit;
}

$token = $_GET['token'];
$isTokenValido = isset($token) && isJwtValido($token);

$versao = getVersao();
$nome = getNome();
$data = getData();
?>

<!DOCTYPE html>
<html>

<head>
  <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
  <link rel="stylesheet" media="all" type="text/css" href="css/vr.css">
  <link rel="stylesheet" media="all" type="text/css" href="css/bootstrap.min.css">
  <link rel="shortcut icon" type="image/x-icon" href="img/favicon.ico" />
  <link rel="stylesheet" type="text/css" href="css/alterar-senha.css">
  <link rel="preconnect" href="https://fonts.googleapis.com">
  <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
  <link
    href="https://fonts.googleapis.com/css2?family=Roboto:ital,wght@0,400;0,500;0,700;1,400;1,500;1,700&display=swap"
    rel="stylesheet">

  <title>
    <?= $nome ?>
  </title>

  <script type="text/javascript" src="js/vr.js"></script>
  <script type="text/javascript" src="js/ajax.js"></script>
  <script type="text/javascript" src="js/alterar-senha.js" defer></script>
</head>

<body>

  <div class="alterar-senha-container">
    <div class="logotipo"></div>
    <img src="img/logotipo.png" style="margin-top: 45px;  margin-left: 35px; height: 200px">

    <?= $isTokenValido ? '<div id="form-container" class="hideable-container">' : '<div id="form-container" class="hideable-container hidden">' ?>
      <h5>Alterar senha</h5>
      <form id="form">
        <input id="senha" type="password" name="senha" maxlength="6" placeholder="Digite a nova senha"
          pattern="[0-9]{6}" />
        <input id="confirmacao-senha" type="password" name="confirmacaoSenha" maxlength="6"
          placeholder="Digite novamente a nova senha" pattern="[0-9]{6}" />
        <p id="form__error" class="hidden"></p>
      </form>

      <div class="action-buttons">
        <button type="button" class="button button--primary" id="enviar">
          <svg xmlns="http://www.w3.org/2000/svg" width="15" height="15" viewBox="0 0 15 15" fill="none">
            <mask id="mask0_250_38" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="0" y="0" width="15" height="15">
              <rect x="0.326172" y="0.347778" width="14" height="14" fill="#D9D9D9" />
            </mask>
            <g mask="url(#mask0_250_38)">
              <path
                d="M6.38668 8.96811L4.76631 7.33153C4.7015 7.26672 4.62869 7.23431 4.54789 7.23431C4.46665 7.23431 4.38823 7.27212 4.31261 7.34774C4.24779 7.41255 4.21539 7.48817 4.21539 7.57459C4.21539 7.66101 4.24779 7.73663 4.31261 7.80144L6.0302 9.51903C6.12742 9.61626 6.24884 9.66487 6.39446 9.66487C6.54051 9.66487 6.66215 9.61626 6.75937 9.51903L10.3242 5.95422C10.389 5.8894 10.4214 5.81638 10.4214 5.73515C10.4214 5.65434 10.3836 5.57613 10.308 5.50051C10.2432 5.4357 10.1675 5.40329 10.0811 5.40329C9.99471 5.40329 9.91909 5.4357 9.85427 5.50051L6.38668 8.96811ZM7.3265 13.1811C6.51631 13.1811 5.75755 13.0272 5.0502 12.7196C4.34242 12.4115 3.72668 11.9954 3.20298 11.4713C2.67884 10.9476 2.26273 10.3318 1.95465 9.62403C1.64699 8.91669 1.49316 8.15792 1.49316 7.34774C1.49316 6.53755 1.64699 5.77857 1.95465 5.07079C2.26273 4.36345 2.67884 3.74771 3.20298 3.22357C3.72668 2.69987 4.34242 2.28397 5.0502 1.97589C5.75755 1.66823 6.51631 1.5144 7.3265 1.5144C8.13668 1.5144 8.89566 1.66823 9.60344 1.97589C10.3108 2.28397 10.9265 2.69987 11.4507 3.22357C11.9744 3.74771 12.3903 4.36345 12.6983 5.07079C13.006 5.77857 13.1598 6.53755 13.1598 7.34774C13.1598 8.15792 13.006 8.91669 12.6983 9.62403C12.3903 10.3318 11.9744 10.9476 11.4507 11.4713C10.9265 11.9954 10.3108 12.4115 9.60344 12.7196C8.89566 13.0272 8.13668 13.1811 7.3265 13.1811Z"
                fill="#3D3D3D" />
            </g>
          </svg>
          <span>Enviar</span>
        </button>
      </div>
    </div>

    <div id="success-container" class="hideable-container hidden">
      <svg xmlns="http://www.w3.org/2000/svg" width="38" height="37" viewBox="0 0 38 37" fill="none">
        <path
          d="M18.8252 0.260864C8.73989 0.260864 0.488281 8.51248 0.488281 18.5978C0.488281 28.6831 8.73989 36.9347 18.8252 36.9347C28.9105 36.9347 37.1621 28.6831 37.1621 18.5978C37.1621 8.51248 28.9105 0.260864 18.8252 0.260864ZM18.8252 33.2673C10.7386 33.2673 4.15566 26.6844 4.15566 18.5978C4.15566 10.5112 10.7386 3.92825 18.8252 3.92825C26.9118 3.92825 33.4947 10.5112 33.4947 18.5978C33.4947 26.6844 26.9118 33.2673 18.8252 33.2673ZM27.2418 10.4929L15.1578 22.5769L10.4086 17.846L7.82305 20.4315L15.1578 27.7662L29.8273 13.0967L27.2418 10.4929Z"
          fill="#F07610" />
      </svg>
      <p>Senha alterada com sucesso!</p>
      <button id="avancar" class="button button--primary">
        <svg xmlns="http://www.w3.org/2000/svg" width="15" height="15" viewBox="0 0 15 15" fill="none">
          <mask id="mask0_263_211" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="0" y="0" width="15" height="15">
            <rect x="0.826172" y="0.108643" width="14" height="14" fill="#D9D9D9" />
          </mask>
          <g mask="url(#mask0_263_211)">
            <path
              d="M6.88571 8.72897L5.26534 7.0924C5.20052 7.02758 5.12771 6.99518 5.04691 6.99518C4.96567 6.99518 4.88725 7.03298 4.81163 7.1086C4.74682 7.17342 4.71441 7.24903 4.71441 7.33545C4.71441 7.42187 4.74682 7.49749 4.81163 7.5623L6.52922 9.2799C6.62645 9.37712 6.74787 9.42573 6.89348 9.42573C7.03953 9.42573 7.16117 9.37712 7.25839 9.2799L10.8232 5.71508C10.888 5.65027 10.9204 5.57724 10.9204 5.49601C10.9204 5.41521 10.8826 5.337 10.807 5.26138C10.7422 5.19656 10.6666 5.16416 10.5801 5.16416C10.4937 5.16416 10.4181 5.19656 10.3533 5.26138L6.88571 8.72897ZM7.82552 12.9419C7.01534 12.9419 6.25657 12.7881 5.54922 12.4805C4.84145 12.1724 4.22571 11.7563 3.702 11.2321C3.17787 10.7084 2.76176 10.0927 2.45367 9.3849C2.14601 8.67755 1.99219 7.91879 1.99219 7.1086C1.99219 6.29842 2.14601 5.53944 2.45367 4.83166C2.76176 4.12431 3.17787 3.50857 3.702 2.98444C4.22571 2.46073 4.84145 2.04484 5.54922 1.73675C6.25657 1.4291 7.01534 1.27527 7.82552 1.27527C8.63571 1.27527 9.39469 1.4291 10.1025 1.73675C10.8098 2.04484 11.4256 2.46073 11.9497 2.98444C12.4734 3.50857 12.8893 4.12431 13.1974 4.83166C13.505 5.53944 13.6589 6.29842 13.6589 7.1086C13.6589 7.91879 13.505 8.67755 13.1974 9.3849C12.8893 10.0927 12.4734 10.7084 11.9497 11.2321C11.4256 11.7563 10.8098 12.1724 10.1025 12.4805C9.39469 12.7881 8.63571 12.9419 7.82552 12.9419Z"
              fill="#3D3D3D" />
          </g>
        </svg>
        <span>Avançar</span>
      </button>
    </div>

    <?= $isTokenValido ? '<div id="error-container" class="hideable-container hidden">' : '<div id="error-container" class="hideable-container">' ?>
      <svg xmlns="http://www.w3.org/2000/svg" width="38" height="38" viewBox="0 0 38 38" fill="none">
        <path
          d="M15.7882 3.18323L16.8005 3.7677L15.7882 3.18323L3.74079 24.0499C2.39101 26.3878 4.07824 29.3102 6.7778 29.3102H30.8726C33.5722 29.3102 35.2594 26.3878 33.9096 24.0499L21.8622 3.18323C20.5124 0.845334 17.138 0.845342 15.7882 3.18323Z"
          stroke="#E86800" stroke-width="2.33789" />
        <path
          d="M19.4082 20.5171H19.6244L19.6517 20.3027L20.8269 11.0651C20.8611 10.8259 20.8868 10.6026 20.9041 10.3954L20.9042 10.3946C20.9214 10.1793 20.9302 9.98719 20.9302 9.81888C20.9302 9.10365 20.7464 8.51376 20.3461 8.08424C19.9439 7.65254 19.3878 7.44998 18.713 7.44998C18.0399 7.44998 17.4845 7.64724 17.0818 8.06955L17.0817 8.06966C16.6885 8.48254 16.5084 9.05239 16.5084 9.74304C16.5084 9.86285 16.5175 10.0267 16.5346 10.2311C16.5519 10.4391 16.5862 10.7384 16.6368 11.1268C16.6368 11.1269 16.6369 11.1271 16.6369 11.1272L17.7996 20.3025L17.8268 20.5171H18.0431H19.4082Z"
          fill="#E86800" stroke="#E86800" stroke-width="0.490957" />
        <path
          d="M20.2624 25.6806L20.2625 25.6806L20.2644 25.6787C20.6899 25.2532 20.9051 24.7314 20.9051 24.1274C20.9051 23.5089 20.6916 22.9749 20.2663 22.5401C19.8412 22.1056 19.3189 21.8849 18.7131 21.8849C18.1147 21.8849 17.5968 22.1064 17.1726 22.5401C16.7473 22.9749 16.5338 23.5089 16.5338 24.1274C16.5338 24.7241 16.7498 25.2413 17.1745 25.666C17.5992 26.0907 18.1164 26.3067 18.7131 26.3067C19.3153 26.3067 19.8365 26.0971 20.2624 25.6806Z"
          fill="#E86800" stroke="#E86800" stroke-width="0.490957" />
      </svg>

      <div id="error-message">
        <?php
        if (!$isTokenValido) {
          echo '<p> Token de redefinição de senha inválido e/ou expirado. </p>';
        }
        ?>
      </div>

      <div class="action-buttons">
        <button id="tentar-novamente" class="button button--primary">
          <svg xmlns="http://www.w3.org/2000/svg" width="15" height="15" viewBox="0 0 15 15" fill="none">
            <mask id="mask0_250_38" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="0" y="0" width="15" height="15">
              <rect x="0.326172" y="0.347778" width="14" height="14" fill="#D9D9D9" />
            </mask>
            <g mask="url(#mask0_250_38)">
              <path
                d="M6.38668 8.96811L4.76631 7.33153C4.7015 7.26672 4.62869 7.23431 4.54789 7.23431C4.46665 7.23431 4.38823 7.27212 4.31261 7.34774C4.24779 7.41255 4.21539 7.48817 4.21539 7.57459C4.21539 7.66101 4.24779 7.73663 4.31261 7.80144L6.0302 9.51903C6.12742 9.61626 6.24884 9.66487 6.39446 9.66487C6.54051 9.66487 6.66215 9.61626 6.75937 9.51903L10.3242 5.95422C10.389 5.8894 10.4214 5.81638 10.4214 5.73515C10.4214 5.65434 10.3836 5.57613 10.308 5.50051C10.2432 5.4357 10.1675 5.40329 10.0811 5.40329C9.99471 5.40329 9.91909 5.4357 9.85427 5.50051L6.38668 8.96811ZM7.3265 13.1811C6.51631 13.1811 5.75755 13.0272 5.0502 12.7196C4.34242 12.4115 3.72668 11.9954 3.20298 11.4713C2.67884 10.9476 2.26273 10.3318 1.95465 9.62403C1.64699 8.91669 1.49316 8.15792 1.49316 7.34774C1.49316 6.53755 1.64699 5.77857 1.95465 5.07079C2.26273 4.36345 2.67884 3.74771 3.20298 3.22357C3.72668 2.69987 4.34242 2.28397 5.0502 1.97589C5.75755 1.66823 6.51631 1.5144 7.3265 1.5144C8.13668 1.5144 8.89566 1.66823 9.60344 1.97589C10.3108 2.28397 10.9265 2.69987 11.4507 3.22357C11.9744 3.74771 12.3903 4.36345 12.6983 5.07079C13.006 5.77857 13.1598 6.53755 13.1598 7.34774C13.1598 8.15792 13.006 8.91669 12.6983 9.62403C12.3903 10.3318 11.9744 10.9476 11.4507 11.4713C10.9265 11.9954 10.3108 12.4115 9.60344 12.7196C8.89566 13.0272 8.13668 13.1811 7.3265 13.1811Z"
                fill="#3D3D3D" />
            </g>
          </svg>
          <span>Tentar Novamente</span>
        </button>

        <button id="cancelar" class="button button--secondary">
          <svg xmlns="http://www.w3.org/2000/svg" width="15" height="15" viewBox="0 0 15 15" fill="none">
            <rect x="2.49219" y="2.36206" width="10.6655" height="10.6655" rx="5.33275" fill="#545454" stroke="#545454" />
            <path
              d="M5.49219 5.36182L7.80467 7.67429C7.81605 7.68568 7.83452 7.68568 7.84591 7.67429L10.1584 5.36182M10.1584 10.028L7.84591 7.71554C7.83452 7.70415 7.81605 7.70415 7.80467 7.71554L5.49219 10.028"
              stroke="white" stroke-width="1.02083" stroke-linecap="round" />
          </svg>
          <span>Cancelar</span>
        </button>
      </div>
    </div>
  </div>

  <?php include 'footer.php'; ?>

</body>

</html>
